import pandas as pd
import os
from alcance import alcance
from arcos import arcos
import costosymadera

# EN ESTE ARCHIVO ESTARÁN TODOS LOS CONJUNTOS Y PARAMETROS

#ruta al csv con los nodos
csv_nodos = os.path.join(os.path.dirname(__file__), 'prediocsv.csv')
# lectura dataframe
df_nodos = pd.read_csv(csv_nodos, sep=';')

# AUXILIARES
nodos_sin_arcos = [9,10,13,54,17,55,48,49,51,107,57,113,20,21,60,116,24,61,64,119,26,29,30,69,70,71,32,33,73,74,35,81,82,83,87,88]
N=costosymadera.dic_nodos
alcances = alcance(df,N_s,N_t)



# CONJUNTOS
R = list(range(1,20))
T = [1, 2, 3, 4, 5, 6, 13, 14, 15, 16, 17, 18] #corresponde a los meses T = ["dic 23","e24", "f24", "mar24", "ab24", "may24", "dic24", "e25", "f25","mar25","ab25","may25"]
U = [1,2]
N = list(range(1,211))
A = arcos(df_nodos, nodos_sin_arcos)
D = [147, 169] # Nodos de destino
N_r = rodales = {
    1: {"hectareas": [1, 2, 3, 4, 5, 6, 7, 8 ,9, 10, 11, 12, 13]},
    2: {"hectareas": [14, 15, 16, 17, 18, 19, 20, 21, 22, 23]},
    3: {"hectareas": [24, 25, 26, 27, 28, 29, 30, 31, 32, 33]},
    4: {"hectareas": [34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45]},
    5: {"hectareas": [46, 47, 48, 49, 50, 51, 52, 53]},
    6: {"hectareas": [54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64]},
    7: {"hectareas": [65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76]},
    8: {"hectareas": [77, 78, 79, 80, 81, 82, 83, 84, 85, 86]},
    9: {"hectareas": [87, 88, 89, 90]},
    10: {"hectareas": [91, 92, 93, 94, 95, 96, 97, 98]},
    11: {"hectareas": [99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110]},
    12: {"hectareas": [111, 112, 113, 114, 115, 116, 117, 118]},
    13: {"hectareas": [119, 120, 121, 122, 123, 124]},
    14: {"hectareas": [125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136]},
    15: {"hectareas": [137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149]},
    16: {"hectareas": [150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169]},
    17: {"hectareas": [170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187]},
    18: {"hectareas": [188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199]},
    19: {"hectareas": [200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210]},
}

'''N_k: queda como N_s y N_t '''
N_s = (1, 2, 4, 7, 8, 11, 12, 14, 15, 16, 18, 19, 22, 23, 25, 28, 31, 34, 37, 40, 89, 90, 46, 47, 84, 91, 92, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 108, 109, 110, 112, 114, 115, 117, 118, 120, 121, 123, 124, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210)
N_t = (50, 52, 58, 62, 63, 27, 65, 66, 36, 77, 78, 39, 42)

RA_r = {1:[], 2:[3],3:[2],4:[5],5:[4],6:[7],
       7:[6,8],8:[7,9],9:[8],10:[15],11:[12],
       12:[11,13],13:[12],14:[18],15:[10],
       16:[17],17:[16],18:[14],19:[]} # Rodales adyacentes que no se pueden cosechar en la misma temporada.

XA = [(27, 65), (36, 77), (36, 39), (39, 38), (39, 42), (50,52), (52,53), (52,56), (53, 111), 
      (56, 59), (58, 59), (58, 62), (59, 63), (62, 63), (62,66), (63, 67), (65, 66), (66, 67),
      (67, 68), (68, 72), (68, 122), (72, 76), (72, 125), (76, 80), (76, 129), (77, 78), (80, 79),
      (80, 84), (80, 133), (84, 92), (84, 137), (92, 140), (103,99), (103, 104), (104, 100), 
      (104, 105), (104, 108), (108, 109), (111, 112), (112, 110), (112,114), (114, 115), (114, 117),
      (117, 118), (117, 120), (120, 121), (120, 123), (122, 123), (122, 125), (123, 124), (123, 126), 
      (125, 126), (125, 129), (129, 130), (129, 133), (133, 134), (133, 137), (137, 138), (137, 140),
      (140, 141), (140, 143)]

R_ki = {clave: valor['radio'] for clave, valor in alcances.items()}


# PARAMETROS

### Generales
P = 35000 #precio madera por metro cúbico
M = 99999999999999999999999999 # N° muy grande
C = 200 #costo construír 100m de camino (1 camino)

### Relacionados a cosecha
v_i = {fila: valores['v'] for fila, valores in N.items()} #para acceder al volumen del nodo i -> v_i[i]
mcc_k = {"skidder":{"mcc":4000}, "torre":{"mcc":5500}}
cf_ik = {fila: {'K': valores['K'], 'cf': valores['cf']} for fila, valores in N.items()} #al acceder a un nodo i -> cf_ik[i] se obtiene diccionario -> ejemplo {'K': 'skidder', 'cf': 35}
#cv_ijk = FALTA HACERLO

### Relacionados a transporte y caminos
ct = 2.6 #costo transporte de cada metro cúbico por 1 camino 100m

print(R_ki)
